"""
部位属性下拉框配置
"""

attr_dict = {
    2: [
        '--',
        '暴击率',
        '暴击伤害',
        '攻击力',
        '防御力',
        '生命值',
        '元素精通',
        '治疗加成'
    ],

    3: [
        '--',
        '攻击力',
        '防御力',
        '生命值',
        '元素伤害加成',
        '火元素伤害加成',
        '水元素伤害加成',
        '雷元素伤害加成',
        '风元素伤害加成',
        '岩元素伤害加成',
        '岩元素伤害加成',
        '物理元素伤害加成',
        '草元素伤害加成'
    ],

    4: [
        '--',
        '攻击力',
        '防御力',
        '生命值',
        '元素充能效率',
        '元素精通'
    ]
}
